RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_sei_regs.h
/* Bitfield definition for register of struct array CTRL: MODE */
/*
 * WLEN (RW)
 *
 * word length
 * 0: 1 bit
 * 1: 2 bit
 * ...
 * 31: 32 bit
 */
#define SEI_CTRL_CMD_MODE_WLEN_MASK (0x1F0000UL)
#define SEI_CTRL_CMD_MODE_WLEN_SHIFT (16U)
#define SEI_CTRL_CMD_MODE_WLEN_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_WLEN_SHIFT) & SEI_CTRL_CMD_MODE_WLEN_MASK)
#define SEI_CTRL_CMD_MODE_WLEN_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_WLEN_MASK) >> SEI_CTRL_CMD_MODE_WLEN_SHIFT)

/*
 * WORDER (RW)
 *
 * word order
 * 0: sample as bit order
 * 1: different from bit order
 */
#define SEI_CTRL_CMD_MODE_WORDER_MASK (0x800U)
#define SEI_CTRL_CMD_MODE_WORDER_SHIFT (11U)
#define SEI_CTRL_CMD_MODE_WORDER_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_WORDER_SHIFT) & SEI_CTRL_CMD_MODE_WORDER_MASK)
#define SEI_CTRL_CMD_MODE_WORDER_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_WORDER_MASK) >> SEI_CTRL_CMD_MODE_WORDER_SHIFT)

/*
 * BORDER (RW)
 *
 * bit order
 * 0: LSB first
 * 1: MSB first
 */
#define SEI_CTRL_CMD_MODE_BORDER_MASK (0x400U)
#define SEI_CTRL_CMD_MODE_BORDER_SHIFT (10U)
#define SEI_CTRL_CMD_MODE_BORDER_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_BORDER_SHIFT) & SEI_CTRL_CMD_MODE_BORDER_MASK)
#define SEI_CTRL_CMD_MODE_BORDER_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_BORDER_MASK) >> SEI_CTRL_CMD_MODE_BORDER_SHIFT)

/*
 * SIGNED (RW)
 *
 * Signed
 * 0: unsigned value
 * 1: signed value
 */
#define SEI_CTRL_CMD_MODE_SIGNED_MASK (0x200U)
#define SEI_CTRL_CMD_MODE_SIGNED_SHIFT (9U)
#define SEI_CTRL_CMD_MODE_SIGNED_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_SIGNED_SHIFT) & SEI_CTRL_CMD_MODE_SIGNED_MASK)
#define SEI_CTRL_CMD_MODE_SIGNED_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_SIGNED_MASK) >> SEI_CTRL_CMD_MODE_SIGNED_SHIFT)

/*
 * REWIND (WC)
 *
 * Write 1 to rewind read/write pointer, this is a self clear bit
 */
#define SEI_CTRL_CMD_MODE_REWIND_MASK (0x100U)
#define SEI_CTRL_CMD_MODE_REWIND_SHIFT (8U)
#define SEI_CTRL_CMD_MODE_REWIND_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_REWIND_SHIFT) & SEI_CTRL_CMD_MODE_REWIND_MASK)
#define SEI_CTRL_CMD_MODE_REWIND_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_REWIND_MASK) >> SEI_CTRL_CMD_MODE_REWIND_SHIFT)

/*
 * MODE (RW)
 *
 * Data mode(CMD register only support data mode)
 * 0: data mode
 * 1: check mode
 * 2: CRC mode
 */
#define SEI_CTRL_CMD_MODE_MODE_MASK (0x3U)
#define SEI_CTRL_CMD_MODE_MODE_SHIFT (0U)
#define SEI_CTRL_CMD_MODE_MODE_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_MODE_MODE_SHIFT) & SEI_CTRL_CMD_MODE_MODE_MASK)
#define SEI_CTRL_CMD_MODE_MODE_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_MODE_MODE_MASK) >> SEI_CTRL_CMD_MODE_MODE_SHIFT)

/* Bitfield definition for register of struct array CTRL: IDX */
/*
 * LAST_BIT (RW)
 *
 * Last bit index for tranceive
 */
#define SEI_CTRL_CMD_IDX_LAST_BIT_MASK (0x1F000000UL)
#define SEI_CTRL_CMD_IDX_LAST_BIT_SHIFT (24U)
#define SEI_CTRL_CMD_IDX_LAST_BIT_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_IDX_LAST_BIT_SHIFT) & SEI_CTRL_CMD_IDX_LAST_BIT_MASK)
#define SEI_CTRL_CMD_IDX_LAST_BIT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_IDX_LAST_BIT_MASK) >> SEI_CTRL_CMD_IDX_LAST_BIT_SHIFT)

/*
 * FIRST_BIT (RW)
 *
 * First bit index for tranceive
 */
#define SEI_CTRL_CMD_IDX_FIRST_BIT_MASK (0x1F0000UL)
#define SEI_CTRL_CMD_IDX_FIRST_BIT_SHIFT (16U)
#define SEI_CTRL_CMD_IDX_FIRST_BIT_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_IDX_FIRST_BIT_SHIFT) & SEI_CTRL_CMD_IDX_FIRST_BIT_MASK)
#define SEI_CTRL_CMD_IDX_FIRST_BIT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_IDX_FIRST_BIT_MASK) >> SEI_CTRL_CMD_IDX_FIRST_BIT_SHIFT)

/*
 * MAX_BIT (RW)
 *
 * Highest bit index
 */
#define SEI_CTRL_CMD_IDX_MAX_BIT_MASK (0x1F00U)
#define SEI_CTRL_CMD_IDX_MAX_BIT_SHIFT (8U)
#define SEI_CTRL_CMD_IDX_MAX_BIT_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_IDX_MAX_BIT_SHIFT) & SEI_CTRL_CMD_IDX_MAX_BIT_MASK)
#define SEI_CTRL_CMD_IDX_MAX_BIT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_IDX_MAX_BIT_MASK) >> SEI_CTRL_CMD_IDX_MAX_BIT_SHIFT)

/*
 * MIN_BIT (RW)
 *
 * Lowest bit index
 */
#define SEI_CTRL_CMD_IDX_MIN_BIT_MASK (0x1FU)
#define SEI_CTRL_CMD_IDX_MIN_BIT_SHIFT (0U)
#define SEI_CTRL_CMD_IDX_MIN_BIT_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_IDX_MIN_BIT_SHIFT) & SEI_CTRL_CMD_IDX_MIN_BIT_MASK)
#define SEI_CTRL_CMD_IDX_MIN_BIT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_IDX_MIN_BIT_MASK) >> SEI_CTRL_CMD_IDX_MIN_BIT_SHIFT)

/* Bitfield definition for register of struct array CTRL: CMD */
/*
 * DATA (RW)
 *
 * DATA
 */
#define SEI_CTRL_CMD_CMD_DATA_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_CMD_DATA_SHIFT (0U)
#define SEI_CTRL_CMD_CMD_DATA_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_CMD_DATA_SHIFT) & SEI_CTRL_CMD_CMD_DATA_MASK)
#define SEI_CTRL_CMD_CMD_DATA_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_CMD_DATA_MASK) >> SEI_CTRL_CMD_CMD_DATA_SHIFT)

/* Bitfield definition for register of struct array CTRL: SET */
/*
 * DATA_SET (RW)
 *
 * DATA bit set
 */
#define SEI_CTRL_CMD_SET_DATA_SET_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_SET_DATA_SET_SHIFT (0U)
#define SEI_CTRL_CMD_SET_DATA_SET_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_SET_DATA_SET_SHIFT) & SEI_CTRL_CMD_SET_DATA_SET_MASK)
#define SEI_CTRL_CMD_SET_DATA_SET_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_SET_DATA_SET_MASK) >> SEI_CTRL_CMD_SET_DATA_SET_SHIFT)

/* Bitfield definition for register of struct array CTRL: CLR */
/*
 * DATA_CLR (RW)
 *
 * DATA bit clear
 */
#define SEI_CTRL_CMD_CLR_DATA_CLR_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_CLR_DATA_CLR_SHIFT (0U)
#define SEI_CTRL_CMD_CLR_DATA_CLR_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_CLR_DATA_CLR_SHIFT) & SEI_CTRL_CMD_CLR_DATA_CLR_MASK)
#define SEI_CTRL_CMD_CLR_DATA_CLR_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_CLR_DATA_CLR_MASK) >> SEI_CTRL_CMD_CLR_DATA_CLR_SHIFT)

/* Bitfield definition for register of struct array CTRL: INV */
/*
 * DATA_TGL (RW)
 *
 * DATA bit toggle
 */
#define SEI_CTRL_CMD_INV_DATA_TGL_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_INV_DATA_TGL_SHIFT (0U)
#define SEI_CTRL_CMD_INV_DATA_TGL_SET(x) (((uint32_t)(x) << SEI_CTRL_CMD_INV_DATA_TGL_SHIFT) & SEI_CTRL_CMD_INV_DATA_TGL_MASK)
#define SEI_CTRL_CMD_INV_DATA_TGL_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_INV_DATA_TGL_MASK) >> SEI_CTRL_CMD_INV_DATA_TGL_SHIFT)

/* Bitfield definition for register of struct array CTRL: IN */
/*
 * DATA_IN (RO)
 *
 * Commad input
 */
#define SEI_CTRL_CMD_IN_DATA_IN_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_IN_DATA_IN_SHIFT (0U)
#define SEI_CTRL_CMD_IN_DATA_IN_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_IN_DATA_IN_MASK) >> SEI_CTRL_CMD_IN_DATA_IN_SHIFT)

/* Bitfield definition for register of struct array CTRL: OUT */
/*
 * DATA_OUT (RO)
 *
 * Command output
 */
#define SEI_CTRL_CMD_OUT_DATA_OUT_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_CMD_OUT_DATA_OUT_SHIFT (0U)
#define SEI_CTRL_CMD_OUT_DATA_OUT_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_OUT_DATA_OUT_MASK) >> SEI_CTRL_CMD_OUT_DATA_OUT_SHIFT)

/* Bitfield definition for register of struct array CTRL: STS */
/*
 * WORD_IDX (RO)
 *
 * Word index
 */
#define SEI_CTRL_CMD_STS_WORD_IDX_MASK (0x1F0000UL)
#define SEI_CTRL_CMD_STS_WORD_IDX_SHIFT (16U)
#define SEI_CTRL_CMD_STS_WORD_IDX_GET(x) (((uint32_t)(x) & SEI_CTRL_CMD_STS_WORD_IDX_MASK) >> SEI_CTRL_CMD_STS_WORD_IDX_SHIFT)

