RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_sei_regs.h
/*
 * SPD_EN (RW)
 *
 * Position include speed
 * 0: use speed from sample override speed register
 * 1: use speed from motor group
 */
#define SEI_CTRL_POS_SMP_EN_SPD_EN_MASK (0x800000UL)
#define SEI_CTRL_POS_SMP_EN_SPD_EN_SHIFT (23U)
#define SEI_CTRL_POS_SMP_EN_SPD_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_EN_SPD_EN_SHIFT) & SEI_CTRL_POS_SMP_EN_SPD_EN_MASK)
#define SEI_CTRL_POS_SMP_EN_SPD_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_EN_SPD_EN_MASK) >> SEI_CTRL_POS_SMP_EN_SPD_EN_SHIFT)

/*
 * SPD_SEL (RW)
 *
 * Data register for speed transfer
 */
#define SEI_CTRL_POS_SMP_EN_SPD_SEL_MASK (0x1F0000UL)
#define SEI_CTRL_POS_SMP_EN_SPD_SEL_SHIFT (16U)
#define SEI_CTRL_POS_SMP_EN_SPD_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_EN_SPD_SEL_SHIFT) & SEI_CTRL_POS_SMP_EN_SPD_SEL_MASK)
#define SEI_CTRL_POS_SMP_EN_SPD_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_EN_SPD_SEL_MASK) >> SEI_CTRL_POS_SMP_EN_SPD_SEL_SHIFT)

/*
 * REV_EN (RW)
 *
 * Position include revolution
 * 0: use revolution from sample override revolution register
 * 1: use revolution  from motor group
 */
#define SEI_CTRL_POS_SMP_EN_REV_EN_MASK (0x8000U)
#define SEI_CTRL_POS_SMP_EN_REV_EN_SHIFT (15U)
#define SEI_CTRL_POS_SMP_EN_REV_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_EN_REV_EN_SHIFT) & SEI_CTRL_POS_SMP_EN_REV_EN_MASK)
#define SEI_CTRL_POS_SMP_EN_REV_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_EN_REV_EN_MASK) >> SEI_CTRL_POS_SMP_EN_REV_EN_SHIFT)

/*
 * REV_SEL (RW)
 *
 * Data register for revolution transfer
 */
#define SEI_CTRL_POS_SMP_EN_REV_SEL_MASK (0x1F00U)
#define SEI_CTRL_POS_SMP_EN_REV_SEL_SHIFT (8U)
#define SEI_CTRL_POS_SMP_EN_REV_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_EN_REV_SEL_SHIFT) & SEI_CTRL_POS_SMP_EN_REV_SEL_MASK)
#define SEI_CTRL_POS_SMP_EN_REV_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_EN_REV_SEL_MASK) >> SEI_CTRL_POS_SMP_EN_REV_SEL_SHIFT)

/*
 * POS_EN (RW)
 *
 * Position include position
 * 0: use position from sample override position register
 * 1: use position from motor group
 */
#define SEI_CTRL_POS_SMP_EN_POS_EN_MASK (0x80U)
#define SEI_CTRL_POS_SMP_EN_POS_EN_SHIFT (7U)
#define SEI_CTRL_POS_SMP_EN_POS_EN_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_EN_POS_EN_SHIFT) & SEI_CTRL_POS_SMP_EN_POS_EN_MASK)
#define SEI_CTRL_POS_SMP_EN_POS_EN_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_EN_POS_EN_MASK) >> SEI_CTRL_POS_SMP_EN_POS_EN_SHIFT)

/*
 * POS_SEL (RW)
 *
 * Data register for position transfer
 */
#define SEI_CTRL_POS_SMP_EN_POS_SEL_MASK (0x1FU)
#define SEI_CTRL_POS_SMP_EN_POS_SEL_SHIFT (0U)
#define SEI_CTRL_POS_SMP_EN_POS_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_EN_POS_SEL_SHIFT) & SEI_CTRL_POS_SMP_EN_POS_SEL_MASK)
#define SEI_CTRL_POS_SMP_EN_POS_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_EN_POS_SEL_MASK) >> SEI_CTRL_POS_SMP_EN_POS_SEL_SHIFT)

/* Bitfield definition for register of struct array CTRL: SMP_CFG */
/*
 * ONCE (RW)
 *
 * Sample one time
 * 0: Sample during windows time
 * 1: Close sample window after first sample
 */
#define SEI_CTRL_POS_SMP_CFG_ONCE_MASK (0x1000000UL)
#define SEI_CTRL_POS_SMP_CFG_ONCE_SHIFT (24U)
#define SEI_CTRL_POS_SMP_CFG_ONCE_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_CFG_ONCE_SHIFT) & SEI_CTRL_POS_SMP_CFG_ONCE_MASK)
#define SEI_CTRL_POS_SMP_CFG_ONCE_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_CFG_ONCE_MASK) >> SEI_CTRL_POS_SMP_CFG_ONCE_SHIFT)

/*
 * LAT_SEL (RW)
 *
 * Latch selection
 * 0: latch 0
 * 1: latch 1
 * 2: latch 2
 * 3: latch 3
 */
#define SEI_CTRL_POS_SMP_CFG_LAT_SEL_MASK (0x30000UL)
#define SEI_CTRL_POS_SMP_CFG_LAT_SEL_SHIFT (16U)
#define SEI_CTRL_POS_SMP_CFG_LAT_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_CFG_LAT_SEL_SHIFT) & SEI_CTRL_POS_SMP_CFG_LAT_SEL_MASK)
#define SEI_CTRL_POS_SMP_CFG_LAT_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_CFG_LAT_SEL_MASK) >> SEI_CTRL_POS_SMP_CFG_LAT_SEL_SHIFT)

/*
 * WINDOW (RW)
 *
 * Sample window, in clock cycle
 */
#define SEI_CTRL_POS_SMP_CFG_WINDOW_MASK (0xFFFFU)
#define SEI_CTRL_POS_SMP_CFG_WINDOW_SHIFT (0U)
#define SEI_CTRL_POS_SMP_CFG_WINDOW_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_CFG_WINDOW_SHIFT) & SEI_CTRL_POS_SMP_CFG_WINDOW_MASK)
#define SEI_CTRL_POS_SMP_CFG_WINDOW_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_CFG_WINDOW_MASK) >> SEI_CTRL_POS_SMP_CFG_WINDOW_SHIFT)

/* Bitfield definition for register of struct array CTRL: SMP_DAT */
/*
 * DAT_SEL (RW)
 *
 * Data register sampled, each bit represent a data register
 */
#define SEI_CTRL_POS_SMP_DAT_DAT_SEL_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_SMP_DAT_DAT_SEL_SHIFT (0U)
#define SEI_CTRL_POS_SMP_DAT_DAT_SEL_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_DAT_DAT_SEL_SHIFT) & SEI_CTRL_POS_SMP_DAT_DAT_SEL_MASK)
#define SEI_CTRL_POS_SMP_DAT_DAT_SEL_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_DAT_DAT_SEL_MASK) >> SEI_CTRL_POS_SMP_DAT_DAT_SEL_SHIFT)

/* Bitfield definition for register of struct array CTRL: SMP_POS */
/*
 * POS (RW)
 *
 * Sample override position
 */
#define SEI_CTRL_POS_SMP_POS_POS_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_SMP_POS_POS_SHIFT (0U)
#define SEI_CTRL_POS_SMP_POS_POS_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_POS_POS_SHIFT) & SEI_CTRL_POS_SMP_POS_POS_MASK)
#define SEI_CTRL_POS_SMP_POS_POS_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_POS_POS_MASK) >> SEI_CTRL_POS_SMP_POS_POS_SHIFT)

/* Bitfield definition for register of struct array CTRL: SMP_REV */
/*
 * REV (RW)
 *
 * Sample override revolution
 */
#define SEI_CTRL_POS_SMP_REV_REV_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_SMP_REV_REV_SHIFT (0U)
#define SEI_CTRL_POS_SMP_REV_REV_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_REV_REV_SHIFT) & SEI_CTRL_POS_SMP_REV_REV_MASK)
#define SEI_CTRL_POS_SMP_REV_REV_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_REV_REV_MASK) >> SEI_CTRL_POS_SMP_REV_REV_SHIFT)

/* Bitfield definition for register of struct array CTRL: SMP_SPD */
/*
 * SPD (RW)
 *
 * Sample override speed
 */
#define SEI_CTRL_POS_SMP_SPD_SPD_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_SMP_SPD_SPD_SHIFT (0U)
#define SEI_CTRL_POS_SMP_SPD_SPD_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_SPD_SPD_SHIFT) & SEI_CTRL_POS_SMP_SPD_SPD_MASK)
#define SEI_CTRL_POS_SMP_SPD_SPD_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_SPD_SPD_MASK) >> SEI_CTRL_POS_SMP_SPD_SPD_SHIFT)

/* Bitfield definition for register of struct array CTRL: SMP_ACC */
/*
 * ACC (RW)
 *
 * Sample override accelerate
 */
#define SEI_CTRL_POS_SMP_ACC_ACC_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_POS_SMP_ACC_ACC_SHIFT (0U)
#define SEI_CTRL_POS_SMP_ACC_ACC_SET(x) (((uint32_t)(x) << SEI_CTRL_POS_SMP_ACC_ACC_SHIFT) & SEI_CTRL_POS_SMP_ACC_ACC_MASK)
#define SEI_CTRL_POS_SMP_ACC_ACC_GET(x) (((uint32_t)(x) & SEI_CTRL_POS_SMP_ACC_ACC_MASK) >> SEI_CTRL_POS_SMP_ACC_ACC_SHIFT)

