RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_sei_regs.h
/*
 * INSTR0_ST (RW)
 *
 * Instruction 0 start
 */
#define SEI_CTRL_IRQ_INT_EN_INSTR0_ST_MASK (0x40U)
#define SEI_CTRL_IRQ_INT_EN_INSTR0_ST_SHIFT (6U)
#define SEI_CTRL_IRQ_INT_EN_INSTR0_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_INSTR0_ST_SHIFT) & SEI_CTRL_IRQ_INT_EN_INSTR0_ST_MASK)
#define SEI_CTRL_IRQ_INT_EN_INSTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_INSTR0_ST_MASK) >> SEI_CTRL_IRQ_INT_EN_INSTR0_ST_SHIFT)

/*
 * PTR1_ST (RW)
 *
 * Pointer 1 start
 */
#define SEI_CTRL_IRQ_INT_EN_PTR1_ST_MASK (0x20U)
#define SEI_CTRL_IRQ_INT_EN_PTR1_ST_SHIFT (5U)
#define SEI_CTRL_IRQ_INT_EN_PTR1_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_PTR1_ST_SHIFT) & SEI_CTRL_IRQ_INT_EN_PTR1_ST_MASK)
#define SEI_CTRL_IRQ_INT_EN_PTR1_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_PTR1_ST_MASK) >> SEI_CTRL_IRQ_INT_EN_PTR1_ST_SHIFT)

/*
 * PTR0_ST (RW)
 *
 * Pointer 0 start
 */
#define SEI_CTRL_IRQ_INT_EN_PTR0_ST_MASK (0x10U)
#define SEI_CTRL_IRQ_INT_EN_PTR0_ST_SHIFT (4U)
#define SEI_CTRL_IRQ_INT_EN_PTR0_ST_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_PTR0_ST_SHIFT) & SEI_CTRL_IRQ_INT_EN_PTR0_ST_MASK)
#define SEI_CTRL_IRQ_INT_EN_PTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_PTR0_ST_MASK) >> SEI_CTRL_IRQ_INT_EN_PTR0_ST_SHIFT)

/*
 * WDOG (RW)
 *
 * Watch dog
 */
#define SEI_CTRL_IRQ_INT_EN_WDOG_MASK (0x4U)
#define SEI_CTRL_IRQ_INT_EN_WDOG_SHIFT (2U)
#define SEI_CTRL_IRQ_INT_EN_WDOG_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_WDOG_SHIFT) & SEI_CTRL_IRQ_INT_EN_WDOG_MASK)
#define SEI_CTRL_IRQ_INT_EN_WDOG_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_WDOG_MASK) >> SEI_CTRL_IRQ_INT_EN_WDOG_SHIFT)

/*
 * EXCEPT (RW)
 *
 * Exception
 */
#define SEI_CTRL_IRQ_INT_EN_EXCEPT_MASK (0x2U)
#define SEI_CTRL_IRQ_INT_EN_EXCEPT_SHIFT (1U)
#define SEI_CTRL_IRQ_INT_EN_EXCEPT_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_EXCEPT_SHIFT) & SEI_CTRL_IRQ_INT_EN_EXCEPT_MASK)
#define SEI_CTRL_IRQ_INT_EN_EXCEPT_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_EXCEPT_MASK) >> SEI_CTRL_IRQ_INT_EN_EXCEPT_SHIFT)

/*
 * STALL (RW)
 *
 * Stall
 */
#define SEI_CTRL_IRQ_INT_EN_STALL_MASK (0x1U)
#define SEI_CTRL_IRQ_INT_EN_STALL_SHIFT (0U)
#define SEI_CTRL_IRQ_INT_EN_STALL_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_EN_STALL_SHIFT) & SEI_CTRL_IRQ_INT_EN_STALL_MASK)
#define SEI_CTRL_IRQ_INT_EN_STALL_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_EN_STALL_MASK) >> SEI_CTRL_IRQ_INT_EN_STALL_SHIFT)

/* Bitfield definition for register of struct array CTRL: INT_FLAG */
/*
 * TRG_ERR3 (W1C)
 *
 * Trigger3 failed
 */
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR3_MASK (0x80000000UL)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR3_SHIFT (31U)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR3_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_TRG_ERR3_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_TRG_ERR3_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR3_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_TRG_ERR3_MASK) >> SEI_CTRL_IRQ_INT_FLAG_TRG_ERR3_SHIFT)

/*
 * TRG_ERR2 (W1C)
 *
 * Trigger2 failed
 */
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR2_MASK (0x40000000UL)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR2_SHIFT (30U)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR2_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_TRG_ERR2_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_TRG_ERR2_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR2_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_TRG_ERR2_MASK) >> SEI_CTRL_IRQ_INT_FLAG_TRG_ERR2_SHIFT)

/*
 * TRG_ERR1 (W1C)
 *
 * Trigger1 failed
 */
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR1_MASK (0x20000000UL)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR1_SHIFT (29U)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR1_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_TRG_ERR1_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_TRG_ERR1_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR1_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_TRG_ERR1_MASK) >> SEI_CTRL_IRQ_INT_FLAG_TRG_ERR1_SHIFT)

/*
 * TRG_ERR0 (W1C)
 *
 * Trigger0 failed
 */
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR0_MASK (0x10000000UL)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR0_SHIFT (28U)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR0_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_TRG_ERR0_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_TRG_ERR0_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_TRG_ERR0_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_TRG_ERR0_MASK) >> SEI_CTRL_IRQ_INT_FLAG_TRG_ERR0_SHIFT)

/*
 * TRIGER3 (W1C)
 *
 * Trigger3
 */
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER3_MASK (0x8000000UL)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER3_SHIFT (27U)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER3_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_TRIGER3_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_TRIGER3_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER3_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_TRIGER3_MASK) >> SEI_CTRL_IRQ_INT_FLAG_TRIGER3_SHIFT)

/*
 * TRIGER2 (W1C)
 *
 * Trigger2
 */
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER2_MASK (0x4000000UL)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER2_SHIFT (26U)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER2_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_TRIGER2_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_TRIGER2_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER2_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_TRIGER2_MASK) >> SEI_CTRL_IRQ_INT_FLAG_TRIGER2_SHIFT)

/*
 * TRIGER1 (W1C)
 *
 * Trigger1
 */
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER1_MASK (0x2000000UL)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER1_SHIFT (25U)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER1_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_TRIGER1_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_TRIGER1_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER1_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_TRIGER1_MASK) >> SEI_CTRL_IRQ_INT_FLAG_TRIGER1_SHIFT)

/*
 * TRIGER0 (W1C)
 *
 * Trigger0
 */
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER0_MASK (0x1000000UL)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER0_SHIFT (24U)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER0_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_TRIGER0_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_TRIGER0_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_TRIGER0_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_TRIGER0_MASK) >> SEI_CTRL_IRQ_INT_FLAG_TRIGER0_SHIFT)

/*
 * SMP_ERR (W1C)
 *
 * Sample error
 */
#define SEI_CTRL_IRQ_INT_FLAG_SMP_ERR_MASK (0x100000UL)
#define SEI_CTRL_IRQ_INT_FLAG_SMP_ERR_SHIFT (20U)
#define SEI_CTRL_IRQ_INT_FLAG_SMP_ERR_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INT_FLAG_SMP_ERR_SHIFT) & SEI_CTRL_IRQ_INT_FLAG_SMP_ERR_MASK)
#define SEI_CTRL_IRQ_INT_FLAG_SMP_ERR_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_FLAG_SMP_ERR_MASK) >> SEI_CTRL_IRQ_INT_FLAG_SMP_ERR_SHIFT)

