RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM5300/ip/hpm_sei_regs.h
/*
 * PTR1_END (RO)
 *
 * Pointer 1 end
 */
#define SEI_CTRL_IRQ_INT_STS_PTR1_END_MASK (0x200U)
#define SEI_CTRL_IRQ_INT_STS_PTR1_END_SHIFT (9U)
#define SEI_CTRL_IRQ_INT_STS_PTR1_END_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_PTR1_END_MASK) >> SEI_CTRL_IRQ_INT_STS_PTR1_END_SHIFT)

/*
 * PTR0_END (RO)
 *
 * Pointer 0 end
 */
#define SEI_CTRL_IRQ_INT_STS_PTR0_END_MASK (0x100U)
#define SEI_CTRL_IRQ_INT_STS_PTR0_END_SHIFT (8U)
#define SEI_CTRL_IRQ_INT_STS_PTR0_END_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_PTR0_END_MASK) >> SEI_CTRL_IRQ_INT_STS_PTR0_END_SHIFT)

/*
 * INSTR1_ST (RO)
 *
 * Instruction 1 start
 */
#define SEI_CTRL_IRQ_INT_STS_INSTR1_ST_MASK (0x80U)
#define SEI_CTRL_IRQ_INT_STS_INSTR1_ST_SHIFT (7U)
#define SEI_CTRL_IRQ_INT_STS_INSTR1_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_INSTR1_ST_MASK) >> SEI_CTRL_IRQ_INT_STS_INSTR1_ST_SHIFT)

/*
 * INSTR0_ST (RO)
 *
 * Instruction 0 start
 */
#define SEI_CTRL_IRQ_INT_STS_INSTR0_ST_MASK (0x40U)
#define SEI_CTRL_IRQ_INT_STS_INSTR0_ST_SHIFT (6U)
#define SEI_CTRL_IRQ_INT_STS_INSTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_INSTR0_ST_MASK) >> SEI_CTRL_IRQ_INT_STS_INSTR0_ST_SHIFT)

/*
 * PTR1_ST (RO)
 *
 * Pointer 1 start
 */
#define SEI_CTRL_IRQ_INT_STS_PTR1_ST_MASK (0x20U)
#define SEI_CTRL_IRQ_INT_STS_PTR1_ST_SHIFT (5U)
#define SEI_CTRL_IRQ_INT_STS_PTR1_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_PTR1_ST_MASK) >> SEI_CTRL_IRQ_INT_STS_PTR1_ST_SHIFT)

/*
 * PTR0_ST (RO)
 *
 * Pointer 0 start
 */
#define SEI_CTRL_IRQ_INT_STS_PTR0_ST_MASK (0x10U)
#define SEI_CTRL_IRQ_INT_STS_PTR0_ST_SHIFT (4U)
#define SEI_CTRL_IRQ_INT_STS_PTR0_ST_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_PTR0_ST_MASK) >> SEI_CTRL_IRQ_INT_STS_PTR0_ST_SHIFT)

/*
 * WDOG (RO)
 *
 * Watch dog
 */
#define SEI_CTRL_IRQ_INT_STS_WDOG_MASK (0x4U)
#define SEI_CTRL_IRQ_INT_STS_WDOG_SHIFT (2U)
#define SEI_CTRL_IRQ_INT_STS_WDOG_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_WDOG_MASK) >> SEI_CTRL_IRQ_INT_STS_WDOG_SHIFT)

/*
 * EXCEPT (RO)
 *
 * Exception
 */
#define SEI_CTRL_IRQ_INT_STS_EXCEPT_MASK (0x2U)
#define SEI_CTRL_IRQ_INT_STS_EXCEPT_SHIFT (1U)
#define SEI_CTRL_IRQ_INT_STS_EXCEPT_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_EXCEPT_MASK) >> SEI_CTRL_IRQ_INT_STS_EXCEPT_SHIFT)

/*
 * STALL (RO)
 *
 * Stall
 */
#define SEI_CTRL_IRQ_INT_STS_STALL_MASK (0x1U)
#define SEI_CTRL_IRQ_INT_STS_STALL_SHIFT (0U)
#define SEI_CTRL_IRQ_INT_STS_STALL_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INT_STS_STALL_MASK) >> SEI_CTRL_IRQ_INT_STS_STALL_SHIFT)

/* Bitfield definition for register of struct array CTRL: POINTER0 */
/*
 * POINTER (RW)
 *
 * Match pointer 0
 */
#define SEI_CTRL_IRQ_POINTER0_POINTER_MASK (0xFFU)
#define SEI_CTRL_IRQ_POINTER0_POINTER_SHIFT (0U)
#define SEI_CTRL_IRQ_POINTER0_POINTER_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_POINTER0_POINTER_SHIFT) & SEI_CTRL_IRQ_POINTER0_POINTER_MASK)
#define SEI_CTRL_IRQ_POINTER0_POINTER_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_POINTER0_POINTER_MASK) >> SEI_CTRL_IRQ_POINTER0_POINTER_SHIFT)

/* Bitfield definition for register of struct array CTRL: POINTER1 */
/*
 * POINTER (RW)
 *
 * Match pointer 1
 */
#define SEI_CTRL_IRQ_POINTER1_POINTER_MASK (0xFFU)
#define SEI_CTRL_IRQ_POINTER1_POINTER_SHIFT (0U)
#define SEI_CTRL_IRQ_POINTER1_POINTER_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_POINTER1_POINTER_SHIFT) & SEI_CTRL_IRQ_POINTER1_POINTER_MASK)
#define SEI_CTRL_IRQ_POINTER1_POINTER_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_POINTER1_POINTER_MASK) >> SEI_CTRL_IRQ_POINTER1_POINTER_SHIFT)

/* Bitfield definition for register of struct array CTRL: INSTR0 */
/*
 * INSTR (RW)
 *
 * Match instruction 0
 */
#define SEI_CTRL_IRQ_INSTR0_INSTR_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_IRQ_INSTR0_INSTR_SHIFT (0U)
#define SEI_CTRL_IRQ_INSTR0_INSTR_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INSTR0_INSTR_SHIFT) & SEI_CTRL_IRQ_INSTR0_INSTR_MASK)
#define SEI_CTRL_IRQ_INSTR0_INSTR_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INSTR0_INSTR_MASK) >> SEI_CTRL_IRQ_INSTR0_INSTR_SHIFT)

/* Bitfield definition for register of struct array CTRL: INSTR1 */
/*
 * INSTR (RW)
 *
 * Match instruction 1
 */
#define SEI_CTRL_IRQ_INSTR1_INSTR_MASK (0xFFFFFFFFUL)
#define SEI_CTRL_IRQ_INSTR1_INSTR_SHIFT (0U)
#define SEI_CTRL_IRQ_INSTR1_INSTR_SET(x) (((uint32_t)(x) << SEI_CTRL_IRQ_INSTR1_INSTR_SHIFT) & SEI_CTRL_IRQ_INSTR1_INSTR_MASK)
#define SEI_CTRL_IRQ_INSTR1_INSTR_GET(x) (((uint32_t)(x) & SEI_CTRL_IRQ_INSTR1_INSTR_MASK) >> SEI_CTRL_IRQ_INSTR1_INSTR_SHIFT)

/* Bitfield definition for register array: INSTR */
/*
 * OP (RW)
 *
 * operation
 * 0: halt
 * 1: jump
 * 2: send with timeout check
 * 3: send without timout check
 * 4: wait with timeout check
 * 5: wait without timout check
 * 6: receive with timeout check
 * 7: receive without timout check
 */
#define SEI_INSTR_OP_MASK (0x1C000000UL)
#define SEI_INSTR_OP_SHIFT (26U)
#define SEI_INSTR_OP_SET(x) (((uint32_t)(x) << SEI_INSTR_OP_SHIFT) & SEI_INSTR_OP_MASK)
#define SEI_INSTR_OP_GET(x) (((uint32_t)(x) & SEI_INSTR_OP_MASK) >> SEI_INSTR_OP_SHIFT)

/*
 * CK (RW)
 *
 * clock
 * 0: low
 * 1: rise-fall
 * 2: fall-rise
 * 3: high
 */
#define SEI_INSTR_CK_MASK (0x3000000UL)
#define SEI_INSTR_CK_SHIFT (24U)
#define SEI_INSTR_CK_SET(x) (((uint32_t)(x) << SEI_INSTR_CK_SHIFT) & SEI_INSTR_CK_MASK)
#define SEI_INSTR_CK_GET(x) (((uint32_t)(x) & SEI_INSTR_CK_MASK) >> SEI_INSTR_CK_SHIFT)

/*
 * CRC (RW)
 *
 * CRC register
 * 0: don't calculate CRC
 * 1: do not set this value
 * 2: data register 2
 * 3: data register 3
 * ...
 * 29: data register 29
 * 30: value 0 when send, wait 0 in receive
 * 31: value1 when send,  wait 1 in receive
 */
#define SEI_INSTR_CRC_MASK (0x1F0000UL)
#define SEI_INSTR_CRC_SHIFT (16U)
#define SEI_INSTR_CRC_SET(x) (((uint32_t)(x) << SEI_INSTR_CRC_SHIFT) & SEI_INSTR_CRC_MASK)
#define SEI_INSTR_CRC_GET(x) (((uint32_t)(x) & SEI_INSTR_CRC_MASK) >> SEI_INSTR_CRC_SHIFT)

/*
 * DAT (RW)
 *
 * DATA register
 * 0: ignore data
 * 1: command
 * 2: data register 2
 * 3: data register 3
 * ...
 * 29: data register 29
 * 30: value 0 when send, wait 0 in receive
 * 31: value1 when send,  wait 1 in receive
 */
#define SEI_INSTR_DAT_MASK (0x1F00U)
#define SEI_INSTR_DAT_SHIFT (8U)
#define SEI_INSTR_DAT_SET(x) (((uint32_t)(x) << SEI_INSTR_DAT_SHIFT) & SEI_INSTR_DAT_MASK)
#define SEI_INSTR_DAT_GET(x) (((uint32_t)(x) & SEI_INSTR_DAT_MASK) >> SEI_INSTR_DAT_SHIFT)

